###################################################################

# Created by write_sdc on Fri Oct 18 14:30:20 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode top
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports reset]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[31]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[30]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[29]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[28]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[27]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[26]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[25]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[24]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[23]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[22]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[21]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[20]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[19]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[18]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[17]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[16]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[15]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[14]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[13]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[12]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[11]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[10]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[9]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[8]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[7]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[6]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[5]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[4]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[3]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[2]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[1]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {instr[0]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[31]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[30]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[29]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[28]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[27]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[26]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[25]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[24]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[23]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[22]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[21]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[20]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[19]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[18]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[17]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[16]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[15]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[14]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[13]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[12]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[11]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[10]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[9]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[8]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[7]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[6]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[5]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[4]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[3]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[2]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[1]}]
set_driving_cell -lib_cell TMRDFFQX1 -pin Q [get_ports {readdata[0]}]
set_load -pin_load 0.0403555 [get_ports {pc[31]}]
set_load -pin_load 0.0403555 [get_ports {pc[30]}]
set_load -pin_load 0.0403555 [get_ports {pc[29]}]
set_load -pin_load 0.0403555 [get_ports {pc[28]}]
set_load -pin_load 0.0403555 [get_ports {pc[27]}]
set_load -pin_load 0.0403555 [get_ports {pc[26]}]
set_load -pin_load 0.0403555 [get_ports {pc[25]}]
set_load -pin_load 0.0403555 [get_ports {pc[24]}]
set_load -pin_load 0.0403555 [get_ports {pc[23]}]
set_load -pin_load 0.0403555 [get_ports {pc[22]}]
set_load -pin_load 0.0403555 [get_ports {pc[21]}]
set_load -pin_load 0.0403555 [get_ports {pc[20]}]
set_load -pin_load 0.0403555 [get_ports {pc[19]}]
set_load -pin_load 0.0403555 [get_ports {pc[18]}]
set_load -pin_load 0.0403555 [get_ports {pc[17]}]
set_load -pin_load 0.0403555 [get_ports {pc[16]}]
set_load -pin_load 0.0403555 [get_ports {pc[15]}]
set_load -pin_load 0.0403555 [get_ports {pc[14]}]
set_load -pin_load 0.0403555 [get_ports {pc[13]}]
set_load -pin_load 0.0403555 [get_ports {pc[12]}]
set_load -pin_load 0.0403555 [get_ports {pc[11]}]
set_load -pin_load 0.0403555 [get_ports {pc[10]}]
set_load -pin_load 0.0403555 [get_ports {pc[9]}]
set_load -pin_load 0.0403555 [get_ports {pc[8]}]
set_load -pin_load 0.0403555 [get_ports {pc[7]}]
set_load -pin_load 0.0403555 [get_ports {pc[6]}]
set_load -pin_load 0.0403555 [get_ports {pc[5]}]
set_load -pin_load 0.0403555 [get_ports {pc[4]}]
set_load -pin_load 0.0403555 [get_ports {pc[3]}]
set_load -pin_load 0.0403555 [get_ports {pc[2]}]
set_load -pin_load 0.0403555 [get_ports {pc[1]}]
set_load -pin_load 0.0403555 [get_ports {pc[0]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[31]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[30]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[29]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[28]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[27]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[26]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[25]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[24]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[23]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[22]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[21]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[20]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[19]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[18]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[17]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[16]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[15]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[14]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[13]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[12]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[11]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[10]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[9]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[8]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[7]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[6]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[5]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[4]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[3]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[2]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[1]}]
set_load -pin_load 0.0403555 [get_ports {pcnext[0]}]
set_load -pin_load 0.0403555 [get_ports memwrite]
set_load -pin_load 0.0403555 [get_ports {aluout[31]}]
set_load -pin_load 0.0403555 [get_ports {aluout[30]}]
set_load -pin_load 0.0403555 [get_ports {aluout[29]}]
set_load -pin_load 0.0403555 [get_ports {aluout[28]}]
set_load -pin_load 0.0403555 [get_ports {aluout[27]}]
set_load -pin_load 0.0403555 [get_ports {aluout[26]}]
set_load -pin_load 0.0403555 [get_ports {aluout[25]}]
set_load -pin_load 0.0403555 [get_ports {aluout[24]}]
set_load -pin_load 0.0403555 [get_ports {aluout[23]}]
set_load -pin_load 0.0403555 [get_ports {aluout[22]}]
set_load -pin_load 0.0403555 [get_ports {aluout[21]}]
set_load -pin_load 0.0403555 [get_ports {aluout[20]}]
set_load -pin_load 0.0403555 [get_ports {aluout[19]}]
set_load -pin_load 0.0403555 [get_ports {aluout[18]}]
set_load -pin_load 0.0403555 [get_ports {aluout[17]}]
set_load -pin_load 0.0403555 [get_ports {aluout[16]}]
set_load -pin_load 0.0403555 [get_ports {aluout[15]}]
set_load -pin_load 0.0403555 [get_ports {aluout[14]}]
set_load -pin_load 0.0403555 [get_ports {aluout[13]}]
set_load -pin_load 0.0403555 [get_ports {aluout[12]}]
set_load -pin_load 0.0403555 [get_ports {aluout[11]}]
set_load -pin_load 0.0403555 [get_ports {aluout[10]}]
set_load -pin_load 0.0403555 [get_ports {aluout[9]}]
set_load -pin_load 0.0403555 [get_ports {aluout[8]}]
set_load -pin_load 0.0403555 [get_ports {aluout[7]}]
set_load -pin_load 0.0403555 [get_ports {aluout[6]}]
set_load -pin_load 0.0403555 [get_ports {aluout[5]}]
set_load -pin_load 0.0403555 [get_ports {aluout[4]}]
set_load -pin_load 0.0403555 [get_ports {aluout[3]}]
set_load -pin_load 0.0403555 [get_ports {aluout[2]}]
set_load -pin_load 0.0403555 [get_ports {aluout[1]}]
set_load -pin_load 0.0403555 [get_ports {aluout[0]}]
set_load -pin_load 0.0403555 [get_ports {writedata[31]}]
set_load -pin_load 0.0403555 [get_ports {writedata[30]}]
set_load -pin_load 0.0403555 [get_ports {writedata[29]}]
set_load -pin_load 0.0403555 [get_ports {writedata[28]}]
set_load -pin_load 0.0403555 [get_ports {writedata[27]}]
set_load -pin_load 0.0403555 [get_ports {writedata[26]}]
set_load -pin_load 0.0403555 [get_ports {writedata[25]}]
set_load -pin_load 0.0403555 [get_ports {writedata[24]}]
set_load -pin_load 0.0403555 [get_ports {writedata[23]}]
set_load -pin_load 0.0403555 [get_ports {writedata[22]}]
set_load -pin_load 0.0403555 [get_ports {writedata[21]}]
set_load -pin_load 0.0403555 [get_ports {writedata[20]}]
set_load -pin_load 0.0403555 [get_ports {writedata[19]}]
set_load -pin_load 0.0403555 [get_ports {writedata[18]}]
set_load -pin_load 0.0403555 [get_ports {writedata[17]}]
set_load -pin_load 0.0403555 [get_ports {writedata[16]}]
set_load -pin_load 0.0403555 [get_ports {writedata[15]}]
set_load -pin_load 0.0403555 [get_ports {writedata[14]}]
set_load -pin_load 0.0403555 [get_ports {writedata[13]}]
set_load -pin_load 0.0403555 [get_ports {writedata[12]}]
set_load -pin_load 0.0403555 [get_ports {writedata[11]}]
set_load -pin_load 0.0403555 [get_ports {writedata[10]}]
set_load -pin_load 0.0403555 [get_ports {writedata[9]}]
set_load -pin_load 0.0403555 [get_ports {writedata[8]}]
set_load -pin_load 0.0403555 [get_ports {writedata[7]}]
set_load -pin_load 0.0403555 [get_ports {writedata[6]}]
set_load -pin_load 0.0403555 [get_ports {writedata[5]}]
set_load -pin_load 0.0403555 [get_ports {writedata[4]}]
set_load -pin_load 0.0403555 [get_ports {writedata[3]}]
set_load -pin_load 0.0403555 [get_ports {writedata[2]}]
set_load -pin_load 0.0403555 [get_ports {writedata[1]}]
set_load -pin_load 0.0403555 [get_ports {writedata[0]}]
set_load -pin_load 0.0403555 [get_ports memread]
set_load -pin_load 0.0403555 [get_ports suspend]
set_max_fanout 6 [get_ports reset]
set_max_fanout 6 [get_ports {instr[31]}]
set_max_fanout 6 [get_ports {instr[30]}]
set_max_fanout 6 [get_ports {instr[29]}]
set_max_fanout 6 [get_ports {instr[28]}]
set_max_fanout 6 [get_ports {instr[27]}]
set_max_fanout 6 [get_ports {instr[26]}]
set_max_fanout 6 [get_ports {instr[25]}]
set_max_fanout 6 [get_ports {instr[24]}]
set_max_fanout 6 [get_ports {instr[23]}]
set_max_fanout 6 [get_ports {instr[22]}]
set_max_fanout 6 [get_ports {instr[21]}]
set_max_fanout 6 [get_ports {instr[20]}]
set_max_fanout 6 [get_ports {instr[19]}]
set_max_fanout 6 [get_ports {instr[18]}]
set_max_fanout 6 [get_ports {instr[17]}]
set_max_fanout 6 [get_ports {instr[16]}]
set_max_fanout 6 [get_ports {instr[15]}]
set_max_fanout 6 [get_ports {instr[14]}]
set_max_fanout 6 [get_ports {instr[13]}]
set_max_fanout 6 [get_ports {instr[12]}]
set_max_fanout 6 [get_ports {instr[11]}]
set_max_fanout 6 [get_ports {instr[10]}]
set_max_fanout 6 [get_ports {instr[9]}]
set_max_fanout 6 [get_ports {instr[8]}]
set_max_fanout 6 [get_ports {instr[7]}]
set_max_fanout 6 [get_ports {instr[6]}]
set_max_fanout 6 [get_ports {instr[5]}]
set_max_fanout 6 [get_ports {instr[4]}]
set_max_fanout 6 [get_ports {instr[3]}]
set_max_fanout 6 [get_ports {instr[2]}]
set_max_fanout 6 [get_ports {instr[1]}]
set_max_fanout 6 [get_ports {instr[0]}]
set_max_fanout 6 [get_ports {readdata[31]}]
set_max_fanout 6 [get_ports {readdata[30]}]
set_max_fanout 6 [get_ports {readdata[29]}]
set_max_fanout 6 [get_ports {readdata[28]}]
set_max_fanout 6 [get_ports {readdata[27]}]
set_max_fanout 6 [get_ports {readdata[26]}]
set_max_fanout 6 [get_ports {readdata[25]}]
set_max_fanout 6 [get_ports {readdata[24]}]
set_max_fanout 6 [get_ports {readdata[23]}]
set_max_fanout 6 [get_ports {readdata[22]}]
set_max_fanout 6 [get_ports {readdata[21]}]
set_max_fanout 6 [get_ports {readdata[20]}]
set_max_fanout 6 [get_ports {readdata[19]}]
set_max_fanout 6 [get_ports {readdata[18]}]
set_max_fanout 6 [get_ports {readdata[17]}]
set_max_fanout 6 [get_ports {readdata[16]}]
set_max_fanout 6 [get_ports {readdata[15]}]
set_max_fanout 6 [get_ports {readdata[14]}]
set_max_fanout 6 [get_ports {readdata[13]}]
set_max_fanout 6 [get_ports {readdata[12]}]
set_max_fanout 6 [get_ports {readdata[11]}]
set_max_fanout 6 [get_ports {readdata[10]}]
set_max_fanout 6 [get_ports {readdata[9]}]
set_max_fanout 6 [get_ports {readdata[8]}]
set_max_fanout 6 [get_ports {readdata[7]}]
set_max_fanout 6 [get_ports {readdata[6]}]
set_max_fanout 6 [get_ports {readdata[5]}]
set_max_fanout 6 [get_ports {readdata[4]}]
set_max_fanout 6 [get_ports {readdata[3]}]
set_max_fanout 6 [get_ports {readdata[2]}]
set_max_fanout 6 [get_ports {readdata[1]}]
set_max_fanout 6 [get_ports {readdata[0]}]
create_clock [get_ports clk]  -period 2  -waveform {0 1}
set_clock_uncertainty 0.2  [get_clocks clk]
set_propagated_clock [get_clocks clk]
set_input_delay -clock clk  -max 0  [get_ports reset]
set_input_delay -clock clk  -max 0  [get_ports {instr[31]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[30]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[29]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[28]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[27]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[26]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[25]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[24]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[23]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[22]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[21]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[20]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[19]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[18]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[17]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[16]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[15]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[14]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[13]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[12]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[11]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[10]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[9]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[8]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[7]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[6]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[5]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[4]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[3]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[2]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[1]}]
set_input_delay -clock clk  -max 0  [get_ports {instr[0]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[31]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[30]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[29]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[28]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[27]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[26]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[25]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[24]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[23]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[22]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[21]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[20]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[19]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[18]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[17]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[16]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[15]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[14]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[13]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[12]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[11]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[10]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[9]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[8]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[7]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[6]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[5]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[4]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[3]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[2]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[1]}]
set_input_delay -clock clk  -max 0  [get_ports {readdata[0]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[31]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[30]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[29]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[28]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[27]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[26]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[25]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[24]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[23]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[22]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[21]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[20]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[19]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[18]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[17]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[16]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[15]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[14]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[13]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[12]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[11]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[10]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[9]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[8]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[7]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[6]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[5]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[4]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[3]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[2]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[1]}]
set_output_delay -clock clk  -max 0  [get_ports {pc[0]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[31]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[30]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[29]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[28]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[27]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[26]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[25]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[24]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[23]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[22]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[21]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[20]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[19]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[18]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[17]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[16]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[15]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[14]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[13]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[12]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[11]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[10]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[9]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[8]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[7]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[6]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[5]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[4]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[3]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[2]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[1]}]
set_output_delay -clock clk  -max 0  [get_ports {pcnext[0]}]
set_output_delay -clock clk  -max 0  [get_ports memwrite]
set_output_delay -clock clk  -max 0  [get_ports {aluout[31]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[30]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[29]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[28]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[27]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[26]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[25]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[24]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[23]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[22]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[21]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[20]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[19]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[18]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[17]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[16]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[15]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[14]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[13]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[12]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[11]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[10]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[9]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[8]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[7]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[6]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[5]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[4]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[3]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[2]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[1]}]
set_output_delay -clock clk  -max 0  [get_ports {aluout[0]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[31]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[30]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[29]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[28]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[27]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[26]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[25]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[24]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[23]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[22]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[21]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[20]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[19]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[18]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[17]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[16]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[15]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[14]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[13]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[12]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[11]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[10]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[9]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[8]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[7]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[6]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[5]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[4]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[3]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[2]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[1]}]
set_output_delay -clock clk  -max 0  [get_ports {writedata[0]}]
set_output_delay -clock clk  -max 0  [get_ports memread]
set_output_delay -clock clk  -max 0  [get_ports suspend]
