###################################################################

# Created by write_sdc on Thu Jul 16 13:16:33 2020

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_wire_load_mode top
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports reset]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[31]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[30]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[29]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[28]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[27]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[26]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[25]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[24]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[23]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[22]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[21]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[20]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[19]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[18]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[17]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[16]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[15]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[14]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[13]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[12]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[11]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[10]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[9]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[8]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[7]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[6]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[5]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[4]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[3]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[2]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[1]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_instr[0]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[31]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[30]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[29]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[28]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[27]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[26]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[25]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[24]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[23]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[22]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[21]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[20]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[19]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[18]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[17]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[16]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[15]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[14]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[13]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[12]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[11]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[10]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[9]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[8]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[7]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[6]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[5]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[4]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[3]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[2]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[1]}]
set_driving_cell -lib_cell DFFPOSX1 -pin Q [get_ports {io_memReadData[0]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[31]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[30]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[29]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[28]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[27]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[26]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[25]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[24]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[23]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[22]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[21]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[20]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[19]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[18]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[17]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[16]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[15]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[14]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[13]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[12]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[11]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[10]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[9]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[8]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[7]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[6]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[5]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[4]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[3]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[2]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[1]}]
set_load -pin_load 0.0156852 [get_ports {io_pc[0]}]
set_load -pin_load 0.0156852 [get_ports io_memWriteEnable]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[31]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[30]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[29]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[28]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[27]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[26]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[25]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[24]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[23]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[22]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[21]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[20]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[19]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[18]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[17]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[16]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[15]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[14]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[13]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[12]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[11]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[10]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[9]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[8]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[7]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[6]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[5]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[4]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[3]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[2]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[1]}]
set_load -pin_load 0.0156852 [get_ports {io_memAddress[0]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[31]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[30]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[29]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[28]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[27]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[26]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[25]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[24]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[23]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[22]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[21]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[20]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[19]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[18]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[17]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[16]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[15]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[14]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[13]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[12]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[11]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[10]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[9]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[8]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[7]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[6]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[5]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[4]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[3]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[2]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[1]}]
set_load -pin_load 0.0156852 [get_ports {io_memWriteData[0]}]
set_max_fanout 6 [get_ports reset]
set_max_fanout 6 [get_ports {io_instr[31]}]
set_max_fanout 6 [get_ports {io_instr[30]}]
set_max_fanout 6 [get_ports {io_instr[29]}]
set_max_fanout 6 [get_ports {io_instr[28]}]
set_max_fanout 6 [get_ports {io_instr[27]}]
set_max_fanout 6 [get_ports {io_instr[26]}]
set_max_fanout 6 [get_ports {io_instr[25]}]
set_max_fanout 6 [get_ports {io_instr[24]}]
set_max_fanout 6 [get_ports {io_instr[23]}]
set_max_fanout 6 [get_ports {io_instr[22]}]
set_max_fanout 6 [get_ports {io_instr[21]}]
set_max_fanout 6 [get_ports {io_instr[20]}]
set_max_fanout 6 [get_ports {io_instr[19]}]
set_max_fanout 6 [get_ports {io_instr[18]}]
set_max_fanout 6 [get_ports {io_instr[17]}]
set_max_fanout 6 [get_ports {io_instr[16]}]
set_max_fanout 6 [get_ports {io_instr[15]}]
set_max_fanout 6 [get_ports {io_instr[14]}]
set_max_fanout 6 [get_ports {io_instr[13]}]
set_max_fanout 6 [get_ports {io_instr[12]}]
set_max_fanout 6 [get_ports {io_instr[11]}]
set_max_fanout 6 [get_ports {io_instr[10]}]
set_max_fanout 6 [get_ports {io_instr[9]}]
set_max_fanout 6 [get_ports {io_instr[8]}]
set_max_fanout 6 [get_ports {io_instr[7]}]
set_max_fanout 6 [get_ports {io_instr[6]}]
set_max_fanout 6 [get_ports {io_instr[5]}]
set_max_fanout 6 [get_ports {io_instr[4]}]
set_max_fanout 6 [get_ports {io_instr[3]}]
set_max_fanout 6 [get_ports {io_instr[2]}]
set_max_fanout 6 [get_ports {io_instr[1]}]
set_max_fanout 6 [get_ports {io_instr[0]}]
set_max_fanout 6 [get_ports {io_memReadData[31]}]
set_max_fanout 6 [get_ports {io_memReadData[30]}]
set_max_fanout 6 [get_ports {io_memReadData[29]}]
set_max_fanout 6 [get_ports {io_memReadData[28]}]
set_max_fanout 6 [get_ports {io_memReadData[27]}]
set_max_fanout 6 [get_ports {io_memReadData[26]}]
set_max_fanout 6 [get_ports {io_memReadData[25]}]
set_max_fanout 6 [get_ports {io_memReadData[24]}]
set_max_fanout 6 [get_ports {io_memReadData[23]}]
set_max_fanout 6 [get_ports {io_memReadData[22]}]
set_max_fanout 6 [get_ports {io_memReadData[21]}]
set_max_fanout 6 [get_ports {io_memReadData[20]}]
set_max_fanout 6 [get_ports {io_memReadData[19]}]
set_max_fanout 6 [get_ports {io_memReadData[18]}]
set_max_fanout 6 [get_ports {io_memReadData[17]}]
set_max_fanout 6 [get_ports {io_memReadData[16]}]
set_max_fanout 6 [get_ports {io_memReadData[15]}]
set_max_fanout 6 [get_ports {io_memReadData[14]}]
set_max_fanout 6 [get_ports {io_memReadData[13]}]
set_max_fanout 6 [get_ports {io_memReadData[12]}]
set_max_fanout 6 [get_ports {io_memReadData[11]}]
set_max_fanout 6 [get_ports {io_memReadData[10]}]
set_max_fanout 6 [get_ports {io_memReadData[9]}]
set_max_fanout 6 [get_ports {io_memReadData[8]}]
set_max_fanout 6 [get_ports {io_memReadData[7]}]
set_max_fanout 6 [get_ports {io_memReadData[6]}]
set_max_fanout 6 [get_ports {io_memReadData[5]}]
set_max_fanout 6 [get_ports {io_memReadData[4]}]
set_max_fanout 6 [get_ports {io_memReadData[3]}]
set_max_fanout 6 [get_ports {io_memReadData[2]}]
set_max_fanout 6 [get_ports {io_memReadData[1]}]
set_max_fanout 6 [get_ports {io_memReadData[0]}]
create_clock [get_ports clk]  -period 100  -waveform {0 50}
set_clock_uncertainty 1  [get_clocks clk]
set_propagated_clock [get_clocks clk]
set_input_delay -clock clk  -max 0  [get_ports reset]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[31]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[30]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[29]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[28]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[27]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[26]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[25]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[24]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[23]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[22]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[21]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[20]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[19]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[18]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[17]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[16]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[15]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[14]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[13]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[12]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[11]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[10]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[9]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[8]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[7]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[6]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[5]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[4]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[3]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[2]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[1]}]
set_input_delay -clock clk  -max 0  [get_ports {io_instr[0]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[31]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[30]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[29]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[28]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[27]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[26]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[25]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[24]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[23]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[22]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[21]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[20]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[19]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[18]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[17]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[16]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[15]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[14]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[13]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[12]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[11]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[10]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[9]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[8]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[7]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[6]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[5]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[4]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[3]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[2]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[1]}]
set_input_delay -clock clk  -max 0  [get_ports {io_memReadData[0]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[31]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[30]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[29]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[28]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[27]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[26]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[25]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[24]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[23]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[22]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[21]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[20]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[19]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[18]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[17]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[16]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[15]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[14]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[13]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[12]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[11]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[10]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[9]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[8]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[7]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[6]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[5]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[4]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[3]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[2]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[1]}]
set_output_delay -clock clk  -max 0  [get_ports {io_pc[0]}]
set_output_delay -clock clk  -max 0  [get_ports io_memWriteEnable]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[31]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[30]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[29]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[28]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[27]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[26]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[25]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[24]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[23]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[22]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[21]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[20]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[19]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[18]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[17]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[16]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[15]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[14]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[13]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[12]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[11]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[10]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[9]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[8]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[7]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[6]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[5]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[4]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[3]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[2]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[1]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memAddress[0]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[31]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[30]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[29]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[28]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[27]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[26]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[25]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[24]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[23]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[22]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[21]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[20]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[19]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[18]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[17]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[16]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[15]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[14]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[13]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[12]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[11]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[10]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[9]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[8]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[7]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[6]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[5]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[4]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[3]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[2]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[1]}]
set_output_delay -clock clk  -max 0  [get_ports {io_memWriteData[0]}]
